[
    {
      "movie_id": "667b1de0f592b5c99c067fc3",
      "user_id": "66995f237dff4b31a53620cf",
      "rating": 4,
      "comment": "The Phantom Menace brings a lot of exciting new elements to the Star Wars universe. The podrace scene is thrilling, and the lightsaber duel with Darth Maul is a standout. However, Jar Jar Binks can be quite annoying.",
      "date": "2024-07-19T01:00:53.199Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc3",
      "user_id": "669353fd608459133c638757",
      "rating": 2,
      "comment": "While the special effects and action sequences are impressive, the story and characters feel underdeveloped. Young Anakin Skywalker doesn't quite fit the role well.",
      "date": "2024-07-19T02:15:30.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc3",
      "user_id": "669322170ec325bbc9027fd7",
      "rating": 3,
      "comment": "A mixed bag. The visuals are stunning, and it's great to see the Jedi in their prime, but the pacing drags and some characters, like Jar Jar Binks, detract from the overall experience.",
      "date": "2024-07-19T03:30:45.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc4",
      "user_id": "66995f237dff4b31a53620cf",
      "rating": 4,
      "comment": "Attack of the Clones improves on its predecessor with a more engaging plot and exciting action scenes. The romance between Anakin and Padmé is a bit forced, but the film overall is entertaining.",
      "date": "2024-07-20T10:00:00.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc4",
      "user_id": "669353fd608459133c638757",
      "rating": 3,
      "comment": "The action and special effects are top-notch, but the dialogue and romantic subplot between Anakin and Padmé are quite awkward. The final battle is a highlight.",
      "date": "2024-07-20T11:30:15.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc4",
      "user_id": "669322170ec325bbc9027fd7",
      "rating": 2,
      "comment": "Despite some visually stunning moments, the movie is bogged down by poor dialogue and a lack of chemistry between the leads. The plot feels disjointed at times.",
      "date": "2024-07-20T13:45:30.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc5",
      "user_id": "66995f237dff4b31a53620cf",
      "rating": 5,
      "comment": "Revenge of the Sith is a thrilling and emotional conclusion to the prequel trilogy. The transformation of Anakin to Darth Vader is well-executed, and the action scenes are spectacular.",
      "date": "2024-07-21T09:00:00.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc5",
      "user_id": "669353fd608459133c638757",
      "rating": 4,
      "comment": "The darkest and most intense of the prequels. The film does a great job of tying the story to the original trilogy, and the action sequences are some of the best in the series.",
      "date": "2024-07-21T10:15:45.000Z"
    },
    {
      "movie_id": "667b1de0f592b5c99c067fc5",
      "user_id": "669322170ec325bbc9027fd7",
      "rating": 3,
      "comment": "An improvement over the previous prequels with a more compelling story and better performances. However, some of the dialogue is still clunky, and the pacing could be better.",
      "date": "2024-07-21T11:30:30.000Z"
    }
  ]